#+TITLE: Project Euler solutions (#1-10)
#+AUTHOR: Steven Kuntz
#+EMAIL: stevenjkuntz@gmail.com
#+OPTIONS: num:nil toc:1
#+PROPERTY: header-args:python :session *python*
#+PROPERTY: header-args :results output :exports both

This begins a series of =org-mode= notebooks with time-efficient solutions to
the [[https://projecteuler.net/][Project Euler]] problems. I didn't take an algorithms class for my computer
science degree, but I love math, so I figured this would be a fine way to learn
those skills. Additionally, I need some well-structured problems to learn the
ins and outs of =org-mode=, and this might as well be it. I plan to use Python
throughout, leveraging =numpy= for its speed with linear algebra, and the
=timeit= tool to compare run times between solutions.

Initialize Python session with imports.

#+begin_src python :results none
from bitarray import bitarray
from functools import reduce
import numpy as np
from math import log
from operator import mul
import timeit
#+end_src

* 1 Multiples of 3 and 5
** Q:

If we list all the natural numbers below 10 that are multiples of 3 or 5,
we get 3, 5, 6 and 9. The sum of these multiples is 23.

Find the sum of all the multiples of 3 or 5 below 1000.

** A:
*** Brute force

It is easy to loop from 2 to \(n\) and check each factor. I like adding tests
to my code blocks with function definitions to assure myself they are robust,
even if I tweak the code or the dependent packages are updated.

#+begin_src python
def multiples_below_n(f,n):
    """Find the multiples of factors in the list `f' that are less than `n'."""
    return [
        m for m in range(2,n)
            if any([m%fi==0 for fi in f])
    ]

assert multiples_below_n([3,5],10) == [3, 5, 6, 9]
#+end_src

#+RESULTS:

This algorithm is \(O(nm)\) where \(m\) is the number of factors. Since we only
have two factors and our upper bound is small, this algorithm is very quick. 

#+begin_src python
print(sum(multiples_below_n([3,5],1000)))

time = min(timeit.repeat(
    "sum(multiples_below_n([3,5],1000))",
    "from __main__ import multiples_below_n",
    number=100
))*10000

print("t = %.2f us" % time)
#+end_src

#+RESULTS:
: 233168
: t = 294.85 us

If we try higher numbers, the run time increases significantly. We can see here
the \(O(n)\) scaling.

#+begin_src python
print(sum(multiples_below_n([3,5],1000000)))

time = min(timeit.repeat(
    "sum(multiples_below_n([3,5],1000000))",
    "from __main__ import multiples_below_n",
    number=1
))*1000

print("t = %.2f ms" % time)
#+end_src

#+RESULTS:
: 233333166668
: t = 304.52 ms

*** Analytic

It is quicker to solve it analytically, even if generality is lost. The
triangular number \(T_N\) can be found in \(O(1)\). Check out the Wikipedia
entry for [[https://en.wikipedia.org/wiki/Triangular_number][triangular numbers]] if you aren't already familiar with this formula.

\[ T_N = 1+2+\ldots+N = \frac{N(N+1)}{2}. \]

And here's a function definition to get that.

#+begin_src python
def triangular(n):
    """Find the ``n``th triangular number."""
    return n*(n+1)//2

assert triangular(1)==1
assert triangular(2)==3
assert triangular(100)==5050
#+end_src

#+RESULTS:

We can write the solution in terms of triangular numbers, making sure to
subtract all multiples of fifteen since they were double-counted by the first
two terms:

\begin{eqnarray*}
S & = & (3+6+\ldots+999) + (5+10+\ldots+995) - (15+30+\ldots+990) \\
  & = & 3(1+2+\ldots+333) + 5(1+2+\ldots+199) - 15(1+2+\ldots+66) \\
  & = & 3T_{333} + 5T_{199} - 15T_{66}
\end{eqnarray*}

The \(T_N\) we use for a factor, \(f\), is easily found given our upper bound,
\(n\). We know \(fN\leq n\) and \(N\) must be an integer. Therefore, 

\[ N = \lfloor n/f \rfloor \]

The sum of all multiples of \(f_1,f_2\) that are less than \(n\) is written as
follows:

\[ S_n(f_1,f_2) = f_1\frac{N_1(N_1+1)}{2} + f_2\frac{N_2(N_2+1)}{2} -
f_3\frac{N_3(N_3+1)}{2} \]

where

\[ N_i = \lfloor \frac{n}{f_i} \rfloor \\
   f_3 = f_1f_2 \]

#+begin_src python
def sum_of_multiples(f1,f2,n):
    """Find the sum of multiples of ``f1`` and ``f2`` less than ``n``."""
    n0 = n-1
    f3 = f1*f2
    return f1*triangular(n0//f1)+f2*triangular(n0//f2)-f3*triangular(n0//(f3))

assert sum_of_multiples(3,5,10) == 23
#+end_src

#+RESULTS:

The final algorithm is \(O(1)\). Any changes in computation time will be the
result of changes in data type induced by changing the size of \(n\).

#+begin_src python
print(sum_of_multiples(3,5,1000))

time = min(timeit.repeat(
    "sum_of_multiples(3,5,1000)",
    "from __main__ import sum_of_multiples, triangular",
    number=1000
))*1000

print("t = %.2f us" % time)
#+end_src

#+RESULTS:
: 233168
: t = 2.46 us

If we try higher numbers, the run time is consistent. We can see here
the \(O(1)\) scaling.

#+begin_src python
print(sum_of_multiples(3,5,1000000))

time = min(timeit.repeat(
    "sum_of_multiples(3,5,1000000)",
    "from __main__ import sum_of_multiples, triangular",
    number=1000
))*1000

print("t = %.2f us" % time)
#+end_src

#+RESULTS:
: 233333166668
: t = 0.66 us

There is a way to generalize this for list of factors, but that is far beyond
the scope of this problem.

* 2 Even Fibonacci numbers
** Q:

Each new term in the Fibonacci sequence is generated by adding the previous
two terms. By starting with 1 and 2, the first 10 terms will be:
1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...

By considering the terms in the Fibonacci sequence whose values do not exceed
four million, find the sum of the even-valued terms.

** A:

Briefly ignoring that the problem statement contains the wrong starting numbers
for the Fibonacci sequence, this is quick and easy to solve by brute force since
there aren't too many Fibonacci numbers below 4000000.

It doesn't make sense to find it analytically since we would need to use
floating point multiplication (see the formula for Fibonacci numbers below) as
opposed to integer addition.

\[ F_n = \frac{\varphi^n-(-\varphi)^{-n}}{\sqrt{5}} \]

where \(\varphi=\frac{1+\sqrt{5}}{2}\).

#+begin_src python
def fibonacci_sequence(n,init=[1,1]):
    """Generate a sequence of Fibonacci numbers, ``F_n<n``."""
    if n<1:
        return None
    F = init
    F_next = F[-2]+F[-1]
    while F_next < n:
        F += [F_next]
        F_next = F[-2]+F[-1]
    return F

assert fibonacci_sequence(2) == [1,1]
assert fibonacci_sequence(90,[1,2]) == [1,2,3,5,8,13,21,34,55,89]
#+end_src

#+RESULTS:

Some marginal savings can be made by recognizing that only \(F_{3i+2}\) are even
and using list slicing to extract those numbers quickly, rather than checking if
every number is even. See the table below as clarification for why this pattern
arises.

\[ \text{odd} + \text{even} = \text{odd} \\
   \text{odd} + \text{odd} = \text{even} \]

| i               |   1 |    2 |   3 |   4 |    5 |   6 |   7 |    8 | ... | 3i  | 3i+1 | 3i+2 |
|-----------------+-----+------+-----+-----+------+-----+-----+------+-----+-----+------+------|
| \(parity(F_i)\) | odd | even | odd | odd | even | odd | odd | even | ... | odd | odd  | even |

#+begin_src python
seq = fibonacci_sequence(4000000,[1,2])
print(sum(seq[1::3]))

time = min(timeit.repeat(
    "sum(fibonacci_sequence(4000000,[1,2])[1::3])",
    "from __main__ import fibonacci_sequence",
    number=1000
))*1000

print("t = %.2f us" % time)
#+end_src

#+RESULTS:
: 4613732
: t = 4.22 us

We can use huge numbers and still get consistent times. The algorithm is
\(O(k)\) where \(k\) is the number of terms in the sequence.

#+begin_src python
seq = fibonacci_sequence(4000000*(10**24),[1,2])
print(sum(seq[1::3]))

time = min(timeit.repeat(
    "sum(fibonacci_sequence(4000000*(10**24),[1,2])[1::3])",
    "from __main__ import fibonacci_sequence",
    number=1000
))*1000

print("t = %.2f us" % time)
#+end_src

#+RESULTS:
: 3080657373857639014791750813074
: t = 17.16 us

* 3 Largest prime factor
** Q:

The prime factors of 13195 are 5, 7, 13 and 29.

What is the largest prime factor of the number 600851475143?

** A:

This can be solved by prime factorization, keeping in mind that all primes
above two are odd and indivisible by three. We could improve the run time by
generating a list of primes, but without knowing the maximum size of the primes,
we would encounter memory errors. In the code below we don't bother to save the
exponents since we only really care about the factors.

#+begin_src python
def prime_factors(n):
    """Find the prime factors of ``n``. Returns only primes, not their
    exponents.
    """
    # if there are no prime factors, or if n is negative, return `None'
    if n <= 1:
        return None

    p = []
    for f in [2,3]:
        if n%f==0:
            p += [f]
            while n%f==0:
                n //= f
    f = 5
    while f<=n:
        if n%f==0:
            p += [f]
            while n%f==0:
                n //= f
        f += 2 if f%6>1 else 4
    return p

assert prime_factors(2) == [2]
assert prime_factors(3) == [3]
assert prime_factors(4) == [2]
assert prime_factors(5) == [5]
assert prime_factors(6) == [2,3]
assert prime_factors(24) == [2,3]
#+end_src

#+RESULTS:

For large numbers and no supplied list of primes the run time of the algorithm
is \(O(n)\).

#+begin_src python
print(prime_factors(600851475143)[-1])

time = min(timeit.repeat(
    "prime_factors(600851475143)[-1]",
    "from __main__ import prime_factors",
    number=100
))*10000

print("t = %.2f us" % time)
#+end_src

#+RESULTS:
: 6857
: t = 216.76 us

* 4 Largest palindrome product
** Q:

A palindromic number reads the same both ways. The largest palindrome made
from the product of two 2-digit numbers is 9009 = 91 × 99.

Find the largest palindrome made from the product of two 3-digit numbers.

** A:
*** Bottom up search

Checking if a number is palindromic is trivial with string manipulation.

#+begin_src python
def is_palindrome(n):
    """Check if an integer ``n`` is a palindrome by converting it to a string."""
    n_str = str(n)
    for i in range(len(n_str)//2):
        if n_str[i]!=n_str[-(i+1)]:
            return False
    return True

assert is_palindrome(9009)
#+end_src

#+RESULTS:

Assuming that both numbers in the product start with nine, we can find all the
palindromes that result from the product of two numbers
\(900\leq n_1,n_2<1000\).

#+begin_src python
a = []
for i in range(900,1000):
    for j in range(i,1000):
        if is_palindrome(i*j):
            a += [i*j]
print(max(a))

time = min(timeit.repeat(
    """
a = []
for i in range(900,1000):
  for j in range(i,1000):
    if is_palindrome(i*j):
      a += [i*j]
    """,
    "from __main__ import is_palindrome",
    number=10
))*100

print("t = %.2f ms" % time)
#+end_src

#+RESULTS:
: 906609
: t = 2.88 ms

*** Top down search

This takes a while to solve since we had to iterate from a lower bound. Starting
from the upper bound will require less iterations. First we need a function to
construct a palindrome from a prefix:

#+begin_src python
def make_palindrome(prefix):
    """Find a palindromic number from a prefix."""
    pre = str(prefix)
    suf = "".join(reversed(pre))
    pal = pre+suf
    return int(pal)

assert make_palindrome(999)==999999
#+end_src

#+RESULTS:

Then, for each possible palindrome, we check for integer products and terminate
once they are found.

#+begin_src python
def largest_palindrome_product(k):
    """Finds the largest palindrome that is a product of two `k'-digit numbers."""
    isfound = False
    pre = 10**k-1
    while not isfound:
        pal = make_palindrome(pre)
        for f in range(10**k-1,10**(k-1)-1,-1):
            if (pal/f)>999 or f*f<pal:
                break
            if pal%f==0:
                isfound = True
                fact = {f, pal//f}
                break
        pre += -1
    return pal, fact

assert largest_palindrome_product(2)==(9009,{91,99})
#+end_src

#+RESULTS:

This algorithm is considerably quicker.

#+begin_src python
print(largest_palindrome_product(3))

time = min(timeit.repeat(
    "largest_palindrome_product(3)",
    "from __main__ import largest_palindrome_product, make_palindrome",
    number=10
))*100
print("t = %.2f ms" % time)
#+end_src

#+RESULTS:
: (906609, {993, 913})
: t = 0.49 ms

* 5 Smallest multiple
** Q:

2520 is the smallest number that can be divided by each of the numbers from
1 to 10 without any remainder.

What is the smallest positive number that is evenly divisible by all of the
numbers from 1 to 20?

** A:
*** Intuitive solution

This is a least common multiple (LCM) problem, but for a list of numbers.
Calculating the LCM directly is very slow, so I'd rather use the greatest common
divisor (GCD) to find the LCM. Using the properties

\[ lcm(a_1,a_2,\ldots,a_n) = lcm(lcm(a_1,a_2,\ldots,a_{n-1}),a_n) \]

and

\[ lcm(a_1,a_2) = \frac{a_1a_2}{gcd(a_1,a_2)} \]

it becomes straightforward to do with Python's =reduce= function from
=functools=.

#+begin_src python
def lcm(a,b=None):
    """Find the least common multiple of a list of integers, recursively."""
    return reduce(lcm, a) if b is None else a*b//gcd(a,b)

def gcd(a,b):
    """Find the greatest common divisor of two integers."""
    while b!=0:
        (a,b) = (b,a%b)
    return a

assert lcm(list(range(1,11))) == 2520
#+end_src

#+RESULTS:

The result is quick to calculate. The LCM is already large for the small numbers
we iterated over.

#+begin_src python
print(lcm(list(range(1,21))))

time = min(timeit.repeat(
    "lcm(list(range(1,21)))",
    "from __main__ import lcm, gcd",
    number=1000
))*1000

print("t = %.2f us" % time)
#+end_src

#+RESULTS:
: 232792560
: t = 5.24 us

For 1, ..., 50000, the LCM grows to over 20000 digits and the computation time
grows to over one second.

#+begin_src python
print(lcm(list(range(1,50001))))

time = min(timeit.repeat(
    "lcm(list(range(1,50001)))",
    "from __main__ import lcm, gcd",
    number=1
))*1000

print("t = %.2f ms" % time)
#+end_src

#+RESULTS:
: 4222978638449904770116605762307998520044123423533732167639477651541581450581770039845437123902585199997157118071589993576529274477627295024237449370325703677105001265672125461973092943612242384410311121778990396543604594051693637216310422184826338313340476997211986822007538618914180909249862250565998637467306124314077131289235324512340376045478302200184701689846411212974440364478825266973510680312810246331200869077969921428769707666786690921442054000670503307966211606861982432909803780465135564858489982094296904994067959371328398985296604749513026440758616555897353708773669712742792939956104907532796915460801200075048052283453220926568795593948318730250712919837904874708539160447344800030809459572169201884390825660970974285236279331447498937450272837073988051826848942060274222988199053941206151801688273657844081770097359837714417842176340105370837818405703305570868875807895557033001207572172078824841494449255727025883873031863201563403326813126194749451238607833761797429539472829027004452607660476391559116687817062197100682663532390771398395168568479009366467443695892948773294705831396823602007692024174514960851316864764446870289241223775641698780907616473541383643117006515615590757856372497367367753796598735370623522182400542205172210141967737797706359438733642195996725121439374007562445047821651224146239046577281433513378123061922299973029824071892306462588897583628911031767310866799063481989631450118760924599579702563626743315342930683162372155606050713109707567907898939429805190850663316318522275387922029569015011781117887029898500166659854231224323871056621680266126070047783974586369748053836836884494284529983238322550259168565219808540178562732210588261378843853194539292097744575628182911377737686452364008843563993252915257752132459172901297146286055392721057876982109613651221781116834581507906083672860989070060090169865938682191795081448114149634384596897179849290521487494129305595014629797263165658575461030447485252764641746935771884371336244758595079543656709867232597799740212971092315613757682331814125279978143937604384473322324433820685964285279987230664647323761695532706684996666602235447792570162446438715962577678789005647515894837944177674947186159409269874017959461280117432115849574590175848825128865187853741382133822190341393083763315673860155310130728195085895807622952978567881842222714968937485903245401592611746244488126075174809783111559815845494022324856858700772557609769818584064849780169553855333836902346735919174409072661837209028353291883405691919729542479135240357254774295889609498637230693261423926829669414212924135374461719033718758934963357224686873419924949175488392658361433248298988642610640250008644644767243077674238320338684308277548750085484240341497591555924829348362492003001121022030032499638924558183390219238426837306605088787027100246019880586050680315731289324956322756711492302641342471751371937637241563550184797403903617083872470380002474622938824109653924241679509752075711856397009379507886582650961837081814963703279163567441066827656111785510013118198585798134054449752109775017742979341964841677262196402491957049637984814994056550657139962206051261362714101907827473661526429738707367102367168604303602800150747419121187377972290380299513481562331174974283804527859195248504185569146049704935650427629210884926805516835537824491401164841177466977611214793311747322965517946645560684230147614095976433585887677795912990435017522622341468891771793629060213533273980753739569546470791891021501511120503852722489544119332911549609895370479053964041833651829913749388841665840308233483644471034367522205076021403405654285170303371658447861509324943695269785203723450643481896189595508636946985652713346925260445752123160806194331640532370672884261253856628094100559721393778611020832994659282275181042359993039038723561106175275696555338570260766866252116482889079985216843909358505194168727213404181685273311127084552073924533587464218511523313426743921355826851087403858029595645662301902782096696101305704951194955272640363977085939325224589369245144704613758832918877351587571550602890059484175749110097134994007489522898594074802563669798312388315573537303624728249453118370052262501515043677920274755769321716515256743154496347438277108949812978146039578272399330257950103076634457852211300185610975276178840413436130932845704183896844702779076057807288947910775179672084483200262653141448335015345962827867620395715714860882275463839124625079911428260105954781751220882875775099511489153805591084728003426385908347158456154666741906427501975895836127875300671493524700046768149132122748601543371253640297706136237832614426999870999286356259244938996110661955897779583932016892002238272378064001303228136889082574372980456758412863870177957133983472614590731451904314304848684636370163214674821426676453063547653699510483294377097919280229376427789513066445210318755688664677888154253551131295381886270145608856099919402481421607035020007096004206778575856632978182418859809772730133532573598099896690033236407599334331268191549834462810050140116959797573469570685034447346135948303271392936773825899598659291561471308610298441391516504740054665834749676761232091536503263879674984582935510134233375790542223897478649596206453766903632702313777760393709028786597767677128658557497582664233557587449301757164030546254063037534000798603124380812682581912062382993837972728639524055638520799273146443502612067466256340531888059862241001019999597290464551419888400394619729909922245831726473729188479989981615049819933886334984799159508083402156266036646032411913725733922140453727238911725872672010213858992881679606749332353054556846602625167439454338954077885704114229729492753963146441421402956055226827018288523044124735301324510893152097551435450629984000876527011716757679477763483179311452463246624785106469375916064649309220762599026474636199340569744145608078881860915696584707837675993398125812282590084969435690275829191911073208767660561629326568471818923664273058443669639744007919808645520056930794995432114617149804667948250167770392715887515029179436169297167145031541920908597148403260302062631423559832947543786232761063733144170668027054294589161274217180231489438101110266363112805106922866206914692123369180881171167677952814825357831363418549222475558043351134586437800164948603224225495155365910509536164694958893956194676302908717166329748344270767276925681198954773062000754003296504456826094634309874638140017962152851539430343732100060911250029414657074504107258007435708630375487091060381699387034617051322168016942248767492284548265475835131176904020445355975025535757472978771503476018026506705842270089667126704552998988037882530601060869984298916146860465978117074945439375909193403426906455306191282688374162591289255640294118683008760431798681442413981213179622497934130910799361531682904339907702269927335311840425451002707392272569676288674541858139099599612114303606971803222503667976353785406551860129223150035669861150349955272828464435942148532469953365719120812529205944337625409122645606035071802472131116713889743793350329298060051070795931002886472747452896895434525186699518704653027461487594199229027431342737034662063881945238636040652440066100470483819017215647270560579776040719594459612635524817635387820911616088437372050117562577984881217908299640306132909500123549152383726616308449874039213910552987057881254095251790765153396352053979457407774321302896488615696367683076447460248176017985226809161922457621277711975531840935314312271435267087559044828880748676618083290093806851037358650430289926837983342529860325037663193284383288617047291273963785963058841883394374387179922740824700539088923713125032028144935157775165381507561673558636367996156779407471604221713942257903281627269140284302854695995097337576277779511481895529611594303850445345275201036791265194651313683177976458786460367497245399514320864365216917914342917925797319459713098877732427544329064653149859982281302484311063305809611481900327517618989086069192966382504772730915561615223836465675592744253101786055477827698538649313382704793180547468090186751972190761461399862426344594146640943105933647941524491763156602567592347186304078781623583229111841845613130903976756535470934733595683877699029657410617536055190500529185989731093515971805564840202356530028247290662173048246690031865256514735230982106194533946697562349152598393297695331052459090647928339013190539555975591960274279942836321948406049074739633144130948234868213908721485370013291334523871573282536154316468806825460027161905405668237739677053018209359207352367661797466045805668911309601975866434091482689120045144044869113764784254861833003563632022687996703645436069040129176784390191521954409436368749823776151126838180500025809350860303648321890784313315887135913362381957628314108576999125462539378896761360392582553379810001292446836569745473969891531443849047857335666435559810413692049645316966212177987557428750936520595177160550820663018343733134024988166584883588472334004020231831693237302847714211689266132715341490072634337020811441987352806546383223619907190927931385115161637934438232061724366995242288681610582427480817144664824134267972539208553215372044106275594505463275058605434353851916769138597169584012869329413532585434117270612539286142299553939782284909390653351260244782232244486765368098070856757600748816450070899765707901952723557181720053645489148841307333330549881658313809743062817506053897750742003012570393418849920416217685067849257516641376870470187657467128941163221211390634829538285629786651768199443969945148189525426975914625678499069056224246021383670978715970010913526584791104107093118053426591702880049013949208623906464091382945398141344868935993161089013634560891202090667792897368159928041808533331349999591093704642700787080451583616614208752389628464079290383849001072812374074897415013835814039349705901120645682672474104411499097909054765692277281550983614374604426459439257997911354899866161310746442751179279052906193404663919391277633586308421299677899223182407628038583745914696932402951857276601062736668783685877164299007189398766174638654217777577261224477706020112715475940679483446389950986207190224204673239006800167272309520255561857169179327799752623788314550462414293237827516125364439965706560423012534692449432275706187615344125372488219770778802052334778949036090335998089795989133300381150023137793388027243027193913712371714068089029831572724680121983439474606864524177849186528844332931720327120588130409012374277149157317126394948751179979753543682050743676924946040530033195362877701506946849835562838032495153341088266251022013647178381417773740863639335765783308346050896368574124361746156379372922367594334707530800791746956642781666988999480465527000010402257503801466448495849249677677833119373615768284616050504976363623040319035491851248843767539441717653081790612936519431636039384457903541716766066257545769888738029376826696644045735667838820030646676183852891360997685472475587446542507688818569573992048342052444045049987676224518130661758733199532636263210456784787428362849933125590186252736446768967614122522974365219478267469707799056100383135418086733840648653575043998789240725321231164219760578643744989370764011685343613059972846765453325233930785327474698977507422711940626190148142705162074593817785438473300139206384181744005011318537578599826797752381340824838599013979404732465258981232366755818521637117807794986446704427116180180138314690359329181536813924960936271309708561989827946356658196457033497325631691037177627558227385426458697325225413844459514815881821926659568841511132911661002289464312036035718080125561467781580401705129210249915430344323059170883330100080847102201710792933278359162439556636821949214655677123499804211279883641554833207391210231271427538435004198862145108291205638333100715127763596790839455521808643756329460090362029819087661951325129596902697695141293515185737607082258157898485890700807565202764957054450589549538356631419562240545941468823775295015340287181419732691718044711924840279800617259482641323607358641986634809672827152994562085879294393443015368276557757543904458633924492576264645191400319964941215602073337562239452273878983578692760124212854748880896297573629753003167285302276205592961854152973933082814373492341598217608297438801789639043259775948689316306197331880955469450751490453104768432131111099057626899748837462027623149630859609968410999039367177333681531160513278410412870152122485470181906146313280293615797639607744069489323470421011434102052801455874910091321913898016912692170536266268042749108463724162950447637993947790359425594545179658690984679229833850197427793063381132398897285617685806748026978255165922818833091303851183038330376102666816207401974106611427502561827971469542996842536797145899573427884498530893500228577998303111876516296055555733482466538892276254740297015259620504905730887125512333938813134836988724099245844759968067466707778466757756082326293615585084467806143107149128063901348248685575123114550700511855589872630805177538324074618655802996008590152786896636838520540733779397065157029831467942155943376141267625360489307118878318017871263288709510560872226878439777812651835732572709377702891939940261291994612402594888756414140790546863379325313575140019515602903294108822626966695420554565149271565671596430834744957341001295036292772380690956657929765899023043235974992970777232590578653986103874744734717030386559514590650833115192997835720473095042885295191062612214528303259762970626734346870069133895757634621447974284108326981990940353992474328932352040991312945415862096819662442160971478577793197439206656134135239031313863189204306331922185834989468109114663348119819628657392145826172427068807968272712223440322729272689522689311277111305495884041843812915042432895003574593867641281478337154547528480622922057688494923010160572689326023503751373019554692705882869779129963422769399819707509617996816967295119612303288625127300262253693734767185001675566555469057386648468811881366743178934327852248600409453546978420608308706117787923590180187757365244156926392630121496255397980020050137690542440710530093889217857847939538511009194881738208254852070948452677525678667901336332515995596668606634608923521620917671381110899379508715084349688566138285478581884815400207330255084576557509827231158695753080851646721030251463852675808149257560300726810875668005473062254322115914135585782569490017875325580692423250214488426880032148163615130138964447871629898934658064121285765162000869635354042220135404918434004215153880020185625341426076089543778151820561737997956507766191682536730375629544443126503138632115110487738487360413467741574291426146846847118165595742583320846269769166856067037393218122946250479976474891466682909186970979868968194599619889680903424305840692517377436150148903227614169421577045517992798871257124924319929387678896268457212140093658400096155650500265512655930938916763650316057144552891478362694917408598220156320955960379961134940617281212413289365563790444202231054077014679828327956042982433649095150809650478542425104291143350264499129551274373549373880532813701132994967198515868311505170124405990668869775902034234199961326296291867239699361619908155356487353813145887250558542327792941213423599128854248095670581127994665189743307701838526570063628780291148145248682243894545479103087788901317782222510283902981174545096008432266633631581828952721120656919842566016468543981495053708353998341997155363355113552705788255562077485682802572758008888192191309584077197405483817176174860839204215451145223661785075926518150643587991805724617818940859502785990049707537162064252657151467023714502316567726812252822481078970990839872471573317549047367825145512788152122135530804933771721030429068806074523824676293447829886843396033784194390209931260752773564835044371428872083097290380745292053966230405068588217010355097969959401817196552490986256468671872343053095855642328970546596335919680970846011054140730635515780703746755707740643872605410834895779871890135546076574164136615907047456621902701530132255742344053865762775590311957334770601435564578420944340228670194496265069180184257617514577103828173050545506986449092874075780333976646910566976761989789626121563353436979571978034066563399802621782982851234998462831758827711547346889660735897864772356362521364592560232238617899978251931543680480472631425332154469676232770526341218846482516729854419181333989016514522271375101992052885184731421624549909846063049644997374913022965021850019921372709494135715894819069070112389499351671971477035011517820297691052689930641904069605539773665561390832739769070809716133150972173811399901280440628194359896525964085719368567212535649455225176960396345090920713040110966894228523719756759335715875378747206288409888051420179256458350303830924128599689677748302039192425285649916086768096134912381952231405758662240928082514256123173986920801632634499904639897459096660375443978514813905770491000468256362111142655103784852948894156176642446730451423777597300715211374243369367211316831846203295169540517507921636373748622771623202830589823559816254342684667128086912374251449859083953199000605686521806615709807910223521584562687029894541334247365007018925466492623016609210626793969806111814138219052254180822154054161754280909095498107821882040791207792140411236947289147226228068718900858752031437493403982995318362229781411168917873025408947244277289083760046426932413138409621632875392078960453321568501541028194113213497030644703036702254178942097059244611304135524759820518277249804917882687577373386237082717571535636936159126333136424804185070869531908774762167438798678299237781482824348392031198251160402021407780836355601645494168316655748706078337907908421126133838285401548348712626047430340148275596491331383981866914256905605656874461448551689739675485444276344572883860993981890396923769612102641943606329761384118595776269981222909651109989284054508888022354839922944708943835404810022280131549073338507570894810005838852941704057856441660700109116049020478773087031003340788739183403296067685320591297059438995184491051280520064135530431612572394918223087713426337489556856988696550640269290025035409770442123014046766497586519675468375524582361255659967572640535309179268142423436678941771268593734472700406945180543162162805026656730071184220690867255941082498098487619178944851219812512181616090529482688299226991857465181892520908820202667186007838427852802241531735239602173964105809085727608462605728064553883061742510413752242859425245307192969603249150717243902671198111864873689580863156893244704486962012062314933824110999916811925849176273542780621412617844358142715779951496949769042266238771993921839517381943581729318417897687603550618047306816431923671252004085120252149951844682552686852070105309728229968766881439645684739712264851731462840018582203598205917392180711428485078779485003572598770003418994234846207251218498391651858257789205414817014869094488619529283551319919239194258674511852469101274544645849979000368469496331362096383135494876951344159192760316161953690254154197200191675239866427437310098658739436089362241368853124034513671481096212361278004167080137594898575836259962386019191388486003811530306109334154434795143289807123115337997627672130759658319635324827034194305351975936012711874472532407613715537910798812167838007709329910797690622404830822601124189840225318420265046145729032794582805579546889790432737507018254994416507237397601931686192170159614060423585926177693492137120954550764002688845297630581127103644075298052372343317173424455237946688789450223252397990026712326140059317253662712734834245234866735922437817249330871011636777551377796874347793170648595806650678714090227505265764224379659987061082618673595466514472921240720481171965041243010749088531908825098503619797713297878680596203093253047116538922506122175474306550369537056242185719203528199748940167074436469971424714050624379711093889252478523545696147014884702481786799361229782935780819239949146576446398905511308685309943878886753973445184177840016459148866524050190904200617036771382316321779780265634809242573242647452655217167310846143590650192697907806298459024417661387368566785452120123560385483878238604130855441920668359998449095564469384188914172715187813085331067689203756708900213184093333986037344242582197999525554102683420520682007071761707590953904919259371897343714255434458155309487013971869039132013230218485285736008913179444203937695659448311410081729907882811347201946849481570646188028837898829749025120078187857476148407901095642550231102640560518482779183118949063202319793514636389218022500195573963637271053798894934644868691310538116865444753200369353262427098572008884464993647818829406913307630573661948622435589682971945715235594847740907859314039789048438563331761086496920381725608425257902923919574770258761052540615820090153530526798426272851827500843538009884955198804142954278550839378900978242816697418886613884639458321143648147367335956282514139731729782589570419244803264068753948629461820366386767589356433832535427565675895476449228580953084289584318389998263559606324654175422169009382121590961751185646091881253825582962670742855379127898972232330424879659966690766769068538937954734899417105671076771054693617497093706522963209754057143414678114272957506439401624634579914844512794202871052003728003645719582070571420388083659424444828434453525262214328177166018197852876764434604802624707076672712439995759371538852565178447330821167684400377947817072274525606439289126145686968685402237946219247840437461603436774471931556813595677748383283325194843772006313376403713789200696112952579046869975468764210526970151236386978197332283784857044439111940390348322959757824000000
: t = 1294.62 ms

*** Efficient shortcut

Consider these two composite numbers and their forms in prime factorization.

\[ 12 = 2^2\cdot3^1\cdot5^0 \\
   15 = 2^0\cdot3^1\cdot5^1 \]

We know that \(lcm(12,15)=60=2^2\cdot3^1\cdot5^1\). In other words, the prime
factorization gives us a way to quickly find the LCM. In general terms this
means

\[ k_a = p_1^{a_1}p_2^{a_2}\ldots \\
   k_b = p_1^{b_1}p_2^{b_2}\ldots \\ 
   lcm(k_a,k_b) = \prod_i p_i^{\max\{a_i,b_i\}} \]

For all \(k\leq n\in\mathbb{N}\), the LCM must be the product of the primes
raised to their maximum possible power within the limit given. I used [[https://en.wikipedia.org/wiki/Sieve_of_Eratosthenes][the Sieve
of Eratosthenes]] to get a list of primes below an upper bound. I made sure to use
a =bitarray= for flagging the primes and a =numpy.array= to return them. You
should check out the Wiki page for a cool visualization of the algorithm.

#+begin_src python
def esieve(n):
    """Find all primes less than ``n`` with the Sieve of Eratosthenes. Saves
    memory by using a ``bitarray`` to store whether or not an integer is prime.
    """
    if n<=2:
        return np.array([])

    isprime = bitarray(n//2)
    isprime.setall(True)

    for k in range(3,int(n**0.5)+1,2):
        if isprime[k//2]:
            isprime[k*k//2::k] = False

    return np.array([2] + [2*i+1 for i in range(1,n//2) if isprime[i]],dtype=int)

assert esieve(2).size == 0
assert esieve(3) == [2]
assert(esieve(10) == [2,3,5,7]).all()
assert(esieve(20) == [2,3,5,7,11,13,17,19]).all()
#+end_src

#+RESULTS:

For the sequence we were given, every natural number up to a limit \(n\) is
represented. For every prime \(p\leq n\), there is a maximum possible exponent
\(a\) such that

\[ p^a \leq n \]

Solving for \(a\) gives

\[ a = \lfloor \log_p n \rfloor = \lfloor \ln n / \ln p \rfloor \]

Therefore, the least common multiple of the series \(1,2,...,n\) is the product

\[ lcm(1,2,\ldots,n) = p_1^{a_1}p_2^{a_2}\ldots p_k^{a_k} \]

where \(p_k\leq n\) are prime and \(a_k = \lfloor \log_p n \rfloor\).

#+begin_src python
def lcm_naturals(n,primes=None):
    """Find the smallest common multiple of the sequence of natural numbers
    `i<=n'.
    """
    if primes is None:
        primes = esieve(n+1)
    return reduce(mul, [int(p**(log(n)//log(p))) for p in primes])

assert lcm_naturals(10) == 2520
#+end_src

#+RESULTS:

The algorithm should be the same computational complexity as the Sieve of
Eratosthenes, \(O(n\log\log n)\).

#+begin_src python
print(lcm_naturals(20))

time = min(timeit.repeat(
    "lcm_naturals(20)",
    "from __main__ import lcm_naturals",
    number=1000
))*1000

print("t = %.2f us" % time)
#+end_src

#+RESULTS:
: 232792560
: t = 23.88 us

This time, for 1, ..., 50000, our computation time remains low, on the order of
milliseconds.

#+begin_src python
print(lcm_naturals(50001))

time = min(timeit.repeat(
    "lcm_naturals(50001)",
    "from __main__ import lcm_naturals",
    number=1
))*1000

print("t = %.2f ms" % time)
#+end_src

#+RESULTS:
: 4222978638449904770116605762307998520044123423533732167639477651541581450581770039845437123902585199997157118071589993576529274477627295024237449370325703677105001265672125461973092943612242384410311121778990396543604594051693637216310422184826338313340476997211986822007538618914180909249862250565998637467306124314077131289235324512340376045478302200184701689846411212974440364478825266973510680312810246331200869077969921428769707666786690921442054000670503307966211606861982432909803780465135564858489982094296904994067959371328398985296604749513026440758616555897353708773669712742792939956104907532796915460801200075048052283453220926568795593948318730250712919837904874708539160447344800030809459572169201884390825660970974285236279331447498937450272837073988051826848942060274222988199053941206151801688273657844081770097359837714417842176340105370837818405703305570868875807895557033001207572172078824841494449255727025883873031863201563403326813126194749451238607833761797429539472829027004452607660476391559116687817062197100682663532390771398395168568479009366467443695892948773294705831396823602007692024174514960851316864764446870289241223775641698780907616473541383643117006515615590757856372497367367753796598735370623522182400542205172210141967737797706359438733642195996725121439374007562445047821651224146239046577281433513378123061922299973029824071892306462588897583628911031767310866799063481989631450118760924599579702563626743315342930683162372155606050713109707567907898939429805190850663316318522275387922029569015011781117887029898500166659854231224323871056621680266126070047783974586369748053836836884494284529983238322550259168565219808540178562732210588261378843853194539292097744575628182911377737686452364008843563993252915257752132459172901297146286055392721057876982109613651221781116834581507906083672860989070060090169865938682191795081448114149634384596897179849290521487494129305595014629797263165658575461030447485252764641746935771884371336244758595079543656709867232597799740212971092315613757682331814125279978143937604384473322324433820685964285279987230664647323761695532706684996666602235447792570162446438715962577678789005647515894837944177674947186159409269874017959461280117432115849574590175848825128865187853741382133822190341393083763315673860155310130728195085895807622952978567881842222714968937485903245401592611746244488126075174809783111559815845494022324856858700772557609769818584064849780169553855333836902346735919174409072661837209028353291883405691919729542479135240357254774295889609498637230693261423926829669414212924135374461719033718758934963357224686873419924949175488392658361433248298988642610640250008644644767243077674238320338684308277548750085484240341497591555924829348362492003001121022030032499638924558183390219238426837306605088787027100246019880586050680315731289324956322756711492302641342471751371937637241563550184797403903617083872470380002474622938824109653924241679509752075711856397009379507886582650961837081814963703279163567441066827656111785510013118198585798134054449752109775017742979341964841677262196402491957049637984814994056550657139962206051261362714101907827473661526429738707367102367168604303602800150747419121187377972290380299513481562331174974283804527859195248504185569146049704935650427629210884926805516835537824491401164841177466977611214793311747322965517946645560684230147614095976433585887677795912990435017522622341468891771793629060213533273980753739569546470791891021501511120503852722489544119332911549609895370479053964041833651829913749388841665840308233483644471034367522205076021403405654285170303371658447861509324943695269785203723450643481896189595508636946985652713346925260445752123160806194331640532370672884261253856628094100559721393778611020832994659282275181042359993039038723561106175275696555338570260766866252116482889079985216843909358505194168727213404181685273311127084552073924533587464218511523313426743921355826851087403858029595645662301902782096696101305704951194955272640363977085939325224589369245144704613758832918877351587571550602890059484175749110097134994007489522898594074802563669798312388315573537303624728249453118370052262501515043677920274755769321716515256743154496347438277108949812978146039578272399330257950103076634457852211300185610975276178840413436130932845704183896844702779076057807288947910775179672084483200262653141448335015345962827867620395715714860882275463839124625079911428260105954781751220882875775099511489153805591084728003426385908347158456154666741906427501975895836127875300671493524700046768149132122748601543371253640297706136237832614426999870999286356259244938996110661955897779583932016892002238272378064001303228136889082574372980456758412863870177957133983472614590731451904314304848684636370163214674821426676453063547653699510483294377097919280229376427789513066445210318755688664677888154253551131295381886270145608856099919402481421607035020007096004206778575856632978182418859809772730133532573598099896690033236407599334331268191549834462810050140116959797573469570685034447346135948303271392936773825899598659291561471308610298441391516504740054665834749676761232091536503263879674984582935510134233375790542223897478649596206453766903632702313777760393709028786597767677128658557497582664233557587449301757164030546254063037534000798603124380812682581912062382993837972728639524055638520799273146443502612067466256340531888059862241001019999597290464551419888400394619729909922245831726473729188479989981615049819933886334984799159508083402156266036646032411913725733922140453727238911725872672010213858992881679606749332353054556846602625167439454338954077885704114229729492753963146441421402956055226827018288523044124735301324510893152097551435450629984000876527011716757679477763483179311452463246624785106469375916064649309220762599026474636199340569744145608078881860915696584707837675993398125812282590084969435690275829191911073208767660561629326568471818923664273058443669639744007919808645520056930794995432114617149804667948250167770392715887515029179436169297167145031541920908597148403260302062631423559832947543786232761063733144170668027054294589161274217180231489438101110266363112805106922866206914692123369180881171167677952814825357831363418549222475558043351134586437800164948603224225495155365910509536164694958893956194676302908717166329748344270767276925681198954773062000754003296504456826094634309874638140017962152851539430343732100060911250029414657074504107258007435708630375487091060381699387034617051322168016942248767492284548265475835131176904020445355975025535757472978771503476018026506705842270089667126704552998988037882530601060869984298916146860465978117074945439375909193403426906455306191282688374162591289255640294118683008760431798681442413981213179622497934130910799361531682904339907702269927335311840425451002707392272569676288674541858139099599612114303606971803222503667976353785406551860129223150035669861150349955272828464435942148532469953365719120812529205944337625409122645606035071802472131116713889743793350329298060051070795931002886472747452896895434525186699518704653027461487594199229027431342737034662063881945238636040652440066100470483819017215647270560579776040719594459612635524817635387820911616088437372050117562577984881217908299640306132909500123549152383726616308449874039213910552987057881254095251790765153396352053979457407774321302896488615696367683076447460248176017985226809161922457621277711975531840935314312271435267087559044828880748676618083290093806851037358650430289926837983342529860325037663193284383288617047291273963785963058841883394374387179922740824700539088923713125032028144935157775165381507561673558636367996156779407471604221713942257903281627269140284302854695995097337576277779511481895529611594303850445345275201036791265194651313683177976458786460367497245399514320864365216917914342917925797319459713098877732427544329064653149859982281302484311063305809611481900327517618989086069192966382504772730915561615223836465675592744253101786055477827698538649313382704793180547468090186751972190761461399862426344594146640943105933647941524491763156602567592347186304078781623583229111841845613130903976756535470934733595683877699029657410617536055190500529185989731093515971805564840202356530028247290662173048246690031865256514735230982106194533946697562349152598393297695331052459090647928339013190539555975591960274279942836321948406049074739633144130948234868213908721485370013291334523871573282536154316468806825460027161905405668237739677053018209359207352367661797466045805668911309601975866434091482689120045144044869113764784254861833003563632022687996703645436069040129176784390191521954409436368749823776151126838180500025809350860303648321890784313315887135913362381957628314108576999125462539378896761360392582553379810001292446836569745473969891531443849047857335666435559810413692049645316966212177987557428750936520595177160550820663018343733134024988166584883588472334004020231831693237302847714211689266132715341490072634337020811441987352806546383223619907190927931385115161637934438232061724366995242288681610582427480817144664824134267972539208553215372044106275594505463275058605434353851916769138597169584012869329413532585434117270612539286142299553939782284909390653351260244782232244486765368098070856757600748816450070899765707901952723557181720053645489148841307333330549881658313809743062817506053897750742003012570393418849920416217685067849257516641376870470187657467128941163221211390634829538285629786651768199443969945148189525426975914625678499069056224246021383670978715970010913526584791104107093118053426591702880049013949208623906464091382945398141344868935993161089013634560891202090667792897368159928041808533331349999591093704642700787080451583616614208752389628464079290383849001072812374074897415013835814039349705901120645682672474104411499097909054765692277281550983614374604426459439257997911354899866161310746442751179279052906193404663919391277633586308421299677899223182407628038583745914696932402951857276601062736668783685877164299007189398766174638654217777577261224477706020112715475940679483446389950986207190224204673239006800167272309520255561857169179327799752623788314550462414293237827516125364439965706560423012534692449432275706187615344125372488219770778802052334778949036090335998089795989133300381150023137793388027243027193913712371714068089029831572724680121983439474606864524177849186528844332931720327120588130409012374277149157317126394948751179979753543682050743676924946040530033195362877701506946849835562838032495153341088266251022013647178381417773740863639335765783308346050896368574124361746156379372922367594334707530800791746956642781666988999480465527000010402257503801466448495849249677677833119373615768284616050504976363623040319035491851248843767539441717653081790612936519431636039384457903541716766066257545769888738029376826696644045735667838820030646676183852891360997685472475587446542507688818569573992048342052444045049987676224518130661758733199532636263210456784787428362849933125590186252736446768967614122522974365219478267469707799056100383135418086733840648653575043998789240725321231164219760578643744989370764011685343613059972846765453325233930785327474698977507422711940626190148142705162074593817785438473300139206384181744005011318537578599826797752381340824838599013979404732465258981232366755818521637117807794986446704427116180180138314690359329181536813924960936271309708561989827946356658196457033497325631691037177627558227385426458697325225413844459514815881821926659568841511132911661002289464312036035718080125561467781580401705129210249915430344323059170883330100080847102201710792933278359162439556636821949214655677123499804211279883641554833207391210231271427538435004198862145108291205638333100715127763596790839455521808643756329460090362029819087661951325129596902697695141293515185737607082258157898485890700807565202764957054450589549538356631419562240545941468823775295015340287181419732691718044711924840279800617259482641323607358641986634809672827152994562085879294393443015368276557757543904458633924492576264645191400319964941215602073337562239452273878983578692760124212854748880896297573629753003167285302276205592961854152973933082814373492341598217608297438801789639043259775948689316306197331880955469450751490453104768432131111099057626899748837462027623149630859609968410999039367177333681531160513278410412870152122485470181906146313280293615797639607744069489323470421011434102052801455874910091321913898016912692170536266268042749108463724162950447637993947790359425594545179658690984679229833850197427793063381132398897285617685806748026978255165922818833091303851183038330376102666816207401974106611427502561827971469542996842536797145899573427884498530893500228577998303111876516296055555733482466538892276254740297015259620504905730887125512333938813134836988724099245844759968067466707778466757756082326293615585084467806143107149128063901348248685575123114550700511855589872630805177538324074618655802996008590152786896636838520540733779397065157029831467942155943376141267625360489307118878318017871263288709510560872226878439777812651835732572709377702891939940261291994612402594888756414140790546863379325313575140019515602903294108822626966695420554565149271565671596430834744957341001295036292772380690956657929765899023043235974992970777232590578653986103874744734717030386559514590650833115192997835720473095042885295191062612214528303259762970626734346870069133895757634621447974284108326981990940353992474328932352040991312945415862096819662442160971478577793197439206656134135239031313863189204306331922185834989468109114663348119819628657392145826172427068807968272712223440322729272689522689311277111305495884041843812915042432895003574593867641281478337154547528480622922057688494923010160572689326023503751373019554692705882869779129963422769399819707509617996816967295119612303288625127300262253693734767185001675566555469057386648468811881366743178934327852248600409453546978420608308706117787923590180187757365244156926392630121496255397980020050137690542440710530093889217857847939538511009194881738208254852070948452677525678667901336332515995596668606634608923521620917671381110899379508715084349688566138285478581884815400207330255084576557509827231158695753080851646721030251463852675808149257560300726810875668005473062254322115914135585782569490017875325580692423250214488426880032148163615130138964447871629898934658064121285765162000869635354042220135404918434004215153880020185625341426076089543778151820561737997956507766191682536730375629544443126503138632115110487738487360413467741574291426146846847118165595742583320846269769166856067037393218122946250479976474891466682909186970979868968194599619889680903424305840692517377436150148903227614169421577045517992798871257124924319929387678896268457212140093658400096155650500265512655930938916763650316057144552891478362694917408598220156320955960379961134940617281212413289365563790444202231054077014679828327956042982433649095150809650478542425104291143350264499129551274373549373880532813701132994967198515868311505170124405990668869775902034234199961326296291867239699361619908155356487353813145887250558542327792941213423599128854248095670581127994665189743307701838526570063628780291148145248682243894545479103087788901317782222510283902981174545096008432266633631581828952721120656919842566016468543981495053708353998341997155363355113552705788255562077485682802572758008888192191309584077197405483817176174860839204215451145223661785075926518150643587991805724617818940859502785990049707537162064252657151467023714502316567726812252822481078970990839872471573317549047367825145512788152122135530804933771721030429068806074523824676293447829886843396033784194390209931260752773564835044371428872083097290380745292053966230405068588217010355097969959401817196552490986256468671872343053095855642328970546596335919680970846011054140730635515780703746755707740643872605410834895779871890135546076574164136615907047456621902701530132255742344053865762775590311957334770601435564578420944340228670194496265069180184257617514577103828173050545506986449092874075780333976646910566976761989789626121563353436979571978034066563399802621782982851234998462831758827711547346889660735897864772356362521364592560232238617899978251931543680480472631425332154469676232770526341218846482516729854419181333989016514522271375101992052885184731421624549909846063049644997374913022965021850019921372709494135715894819069070112389499351671971477035011517820297691052689930641904069605539773665561390832739769070809716133150972173811399901280440628194359896525964085719368567212535649455225176960396345090920713040110966894228523719756759335715875378747206288409888051420179256458350303830924128599689677748302039192425285649916086768096134912381952231405758662240928082514256123173986920801632634499904639897459096660375443978514813905770491000468256362111142655103784852948894156176642446730451423777597300715211374243369367211316831846203295169540517507921636373748622771623202830589823559816254342684667128086912374251449859083953199000605686521806615709807910223521584562687029894541334247365007018925466492623016609210626793969806111814138219052254180822154054161754280909095498107821882040791207792140411236947289147226228068718900858752031437493403982995318362229781411168917873025408947244277289083760046426932413138409621632875392078960453321568501541028194113213497030644703036702254178942097059244611304135524759820518277249804917882687577373386237082717571535636936159126333136424804185070869531908774762167438798678299237781482824348392031198251160402021407780836355601645494168316655748706078337907908421126133838285401548348712626047430340148275596491331383981866914256905605656874461448551689739675485444276344572883860993981890396923769612102641943606329761384118595776269981222909651109989284054508888022354839922944708943835404810022280131549073338507570894810005838852941704057856441660700109116049020478773087031003340788739183403296067685320591297059438995184491051280520064135530431612572394918223087713426337489556856988696550640269290025035409770442123014046766497586519675468375524582361255659967572640535309179268142423436678941771268593734472700406945180543162162805026656730071184220690867255941082498098487619178944851219812512181616090529482688299226991857465181892520908820202667186007838427852802241531735239602173964105809085727608462605728064553883061742510413752242859425245307192969603249150717243902671198111864873689580863156893244704486962012062314933824110999916811925849176273542780621412617844358142715779951496949769042266238771993921839517381943581729318417897687603550618047306816431923671252004085120252149951844682552686852070105309728229968766881439645684739712264851731462840018582203598205917392180711428485078779485003572598770003418994234846207251218498391651858257789205414817014869094488619529283551319919239194258674511852469101274544645849979000368469496331362096383135494876951344159192760316161953690254154197200191675239866427437310098658739436089362241368853124034513671481096212361278004167080137594898575836259962386019191388486003811530306109334154434795143289807123115337997627672130759658319635324827034194305351975936012711874472532407613715537910798812167838007709329910797690622404830822601124189840225318420265046145729032794582805579546889790432737507018254994416507237397601931686192170159614060423585926177693492137120954550764002688845297630581127103644075298052372343317173424455237946688789450223252397990026712326140059317253662712734834245234866735922437817249330871011636777551377796874347793170648595806650678714090227505265764224379659987061082618673595466514472921240720481171965041243010749088531908825098503619797713297878680596203093253047116538922506122175474306550369537056242185719203528199748940167074436469971424714050624379711093889252478523545696147014884702481786799361229782935780819239949146576446398905511308685309943878886753973445184177840016459148866524050190904200617036771382316321779780265634809242573242647452655217167310846143590650192697907806298459024417661387368566785452120123560385483878238604130855441920668359998449095564469384188914172715187813085331067689203756708900213184093333986037344242582197999525554102683420520682007071761707590953904919259371897343714255434458155309487013971869039132013230218485285736008913179444203937695659448311410081729907882811347201946849481570646188028837898829749025120078187857476148407901095642550231102640560518482779183118949063202319793514636389218022500195573963637271053798894934644868691310538116865444753200369353262427098572008884464993647818829406913307630573661948622435589682971945715235594847740907859314039789048438563331761086496920381725608425257902923919574770258761052540615820090153530526798426272851827500843538009884955198804142954278550839378900978242816697418886613884639458321143648147367335956282514139731729782589570419244803264068753948629461820366386767589356433832535427565675895476449228580953084289584318389998263559606324654175422169009382121590961751185646091881253825582962670742855379127898972232330424879659966690766769068538937954734899417105671076771054693617497093706522963209754057143414678114272957506439401624634579914844512794202871052003728003645719582070571420388083659424444828434453525262214328177166018197852876764434604802624707076672712439995759371538852565178447330821167684400377947817072274525606439289126145686968685402237946219247840437461603436774471931556813595677748383283325194843772006313376403713789200696112952579046869975468764210526970151236386978197332283784857044439111940390348322959757824000000
: t = 17.79 ms

* 6 Sum square difference
** Q:

The sum of the squares of the first ten natural numbers is,

\[ 1^2 + 2^2 + \ldots + 10^2 = 385 \]

The square of the sum of the first ten natural numbers is,

\[ (1 + 2 + \ldots + 10)^2 = 55^2 = 3025 \]

Hence the difference between the sum of the squares of the first ten natural
numbers and the square of the sum is 3025 − 385 = 2640.

Find the difference between the square of the sum and the sum of the squares of
the first one hundred natural numbers.

** A:

Recall from [[* 1 Multiples of 3 and 5][problem 1]] the formula for the \(n\)th triangular number, \(T_n\).

\[ T_n = 1+2+\ldots+n = \frac{n(n+1)}{2} \]

Now consider the [[https://en.wikipedia.org/wiki/Square_pyramidal_number][square pyramidal numbers]], \(P_n\). Again, if you aren't
familiar with this series or its derivation, check out the Wikipedia page.

\[ P_n = 1^2+2^2+\ldots+n^2 = \frac{n(n+1)(2n+1)}{6} \]

#+begin_src python
def square_pyramidal(n):
    """Find the `n'th square pyramidal number."""
    return n*(n+1)*(2*n+1)//6

assert square_pyramidal(1)==1
assert square_pyramidal(2)==5
assert square_pyramidal(4)==30
#+end_src

#+RESULTS:

Let \(f\) be the difference between the sum of the squares and the square of the
sum for the first \(n\) natural numbers. 

\begin{eqnarray*}
f(n) & = & \left[\sum_{i=1}^n i \right]^2 -
           \left[\sum_{i=1}^n i^2 \right] \\
     & = & T_n^2 - P_n
\end{eqnarray*}

#+begin_src python
def sum_sq_diff(n):
    """For the first `n' natural numbers, find the difference between the square
    of the sum and the sum of the squares.
    """
    return triangular(n)**2 - square_pyramidal(n)

assert sum_sq_diff(10) == 2640
#+end_src

#+RESULTS:

A solution is quick to find because the algorithm is \(O(1)\).

#+begin_src python
print(sum_sq_diff(100))

time = min(timeit.repeat(
    "sum_sq_diff(100)",
    "from __main__ import sum_sq_diff",
    number=1000
))*1000

print("t = %.2f us" % time)
#+end_src

#+RESULTS:
: 25164150
: t = 0.46 us

This algorithmic scaling extends to large numbers.

#+begin_src python
print(sum_sq_diff(10**24))

time = min(timeit.repeat(
    "sum_sq_diff(10**24)",
    "from __main__ import sum_sq_diff",
    number=1000
))*1000

print("t = %.2f us" % time)
#+end_src

#+RESULTS:
: 250000000000000000000000166666666666666666666666416666666666666666666666500000000000000000000000
: t = 0.78 us

* 7 10001st prime
** Q:

By listing the first six prime numbers: 2, 3, 5, 7, 11, and 13, we can see
that the 6th prime is 13.

What is the 10 001st prime number?

** A:

We should use the Sieve of Eratosthenes (see [[5 Smallest multiple][problem 5]]) to find this, but first
we need to approximate what our upper bound should be. [[https://en.wikipedia.org/wiki/Prime_number_theorem#Approximations_for_the_nth_prime_number][According to Dusart]], the
\(n\)th prime, \(p_n\), is bound by the following inequality.

\[ n(\log n + \log\log n - 1) < p_n < n(\log n + \log\log n) \]

for \(n\geq6\).

#+begin_src python
def prime_bounds(n):
    """Find the lower and upper bounds of the ``n``th prime."""
    assert type(n)==int and n>=1, "n must be a positive integer."
    if n<6:
        return [1,14]
    else:
        lim = log(n)+log(log(n))
        return [int(n*(lim-1)),int(n*lim+1)]

assert prime_bounds(4) == [1,14]
assert prime_bounds(6) == [8,15]
assert prime_bounds(10) == [21,32]
#+end_src

#+RESULTS:

I used the upper bound from the above calculation to perform a Sieve of
Eratosthenes and return the 10001st prime. The overall algorithm should be about
the same complexity as the sieve, \(O(n\log\log n)\). Any additional complexity
results from overestimation of our upper bound.

#+begin_src python
bounds = prime_bounds(10001)
print(esieve(bounds[1])[10000])

time = min(timeit.repeat(
    "esieve(prime_bounds(10001)[1])[10000]",
    "from __main__ import esieve, prime_bounds",
    number=1
))*1000

print("t = %.2f ms" % time)
#+end_src

#+RESULTS:
: 104743
: t = 4.73 ms

This Python implementation is fine for \(n<10^9\), but above that we will run
into memory limitations. For large numbers it would be better to code in a
compiled language and use a more efficient sieve algorithm.

#+begin_src python
bounds = prime_bounds(100001)
print(esieve(bounds[1])[100000])

time = min(timeit.repeat(
    "esieve(prime_bounds(100001)[1])[100000]",
    "from __main__ import esieve, prime_bounds",
    number=1
))*1000

print("t = %.2f ms" % time)
#+end_src

#+RESULTS:
: 1299721
: t = 54.16 ms

* 8 Largest product in a series
** Q:

The four adjacent digits in the 1000-digit number that have the greatest
product are 9 × 9 × 8 × 9 = 5832.

#+begin_src python
number = "73167176531330624919225119674426574742355349194934\
96983520312774506326239578318016984801869478851843\
85861560789112949495459501737958331952853208805511\
12540698747158523863050715693290963295227443043557\
66896648950445244523161731856403098711121722383113\
62229893423380308135336276614282806444486645238749\
30358907296290491560440772390713810515859307960866\
70172427121883998797908792274921901699720888093776\
65727333001053367881220235421809751254540594752243\
52584907711670556013604839586446706324415722155397\
53697817977846174064955149290862569321978468622482\
83972241375657056057490261407972968652414535100474\
82166370484403199890008895243450658541227588666881\
16427171479924442928230863465674813919123162824586\
17866458359124566529476545682848912883142607690042\
24219022671055626321111109370544217506941658960408\
07198403850962455444362981230987879927244284909188\
84580156166097919133875499200524063689912560717606\
05886116467109405077541002256983155200055935729725\
71636269561882670428252483600823257530420752963450"

v = np.array([int(d) for d in number],dtype=int)
#+end_src

#+RESULTS:

Find the thirteen adjacent digits in the 1000-digit number that have the
greatest product. What is the value of this product?

** A:

This is a moving window problem. Let \(N\) be a number with \(n\) digits,  \(\mathbf{p}\)
be a vector where the elements \(p_i\) are the products of \(w > 1\) adjacent
digits of \(N\), starting with \(d_i\).

\[ N = d_1d_2...d_n \]

\[ \mathbf{p} \in \mathbb{R}^{n-w+1} \]

\[ p_i = \prod_{k=i}^{i+w-1} d_k \]

#+begin_src python
def adjacent_products(v,w):
    """Find the products of `w' adjacent elements in the vector `v'."""
    n = len(v)
    p = np.ones((n-w+1,),dtype=int)
    for i in range(0,w):
        p = np.multiply(p,v[i:n+i-w+1])
    return p

assert max(adjacent_products(v,4)) == 5832
#+end_src

#+RESULTS:

=numpy= does vector operations extremely quickly.

#+begin_src python
print(max(adjacent_products(v,13)))

time = min(timeit.repeat(
    "adjacent_products(v,13)",
    "from __main__ import adjacent_products, v",
    number=1000
))*1000

print("t = %.2f us" % time)
#+end_src

#+RESULTS:
: 23514624000
: t = 17.80 us

* 9 Special Pythagorean triplet
** Q:

A Pythagorean triple is a set of three natural numbers, \(a < b < c\), for
which,

\[ a^2 + b^2 = c^2 \]

For example, \(3^2 + 4^2 = 9 + 16 = 25 = 5^2\).

There exists exactly one Pythagorean triplet for which \(a + b + c = 1000\).
Find the product \(abc\).

** A:

Using [[https://en.wikipedia.org/wiki/Pythagorean_triple#Generating_a_triple][Euclid's formula]] for the primitive Pythagorean triples:

\[ a^2 + b^2 = c^2 \\
   a=m^2-n^2 \\
   b=2mn \\
   c=m^2+n^2 \]

where \(m>n>0\), \(m\) and \(n\) are coprime (\(gcd(m,n)=1\)) and one is even.
Since we don't necessarily need these triples to be primitive, we'll rewrite the
formula by adding in some common divisor, \(d\).

\[ a=d(m^2-n^2) \\
   b=d(2mn) \\
   c=d(m^2+n^2) \]

Introducing a constraint on the sum, \(a+b+c=s\), gives

\begin{eqnarray*}
s & = & a + b + c \\
  & = & d(m^2-n^2) + d(2mn) + d(m^2+n^2) \\
  & = & 2dm^2 + 2dmn \\
  & = & 2dm(m+n) \\
  & = & 2dmk
\end{eqnarray*}

A few interesting things to point out here. Try plugging in numbers if any of
these points don't make sense.

1) \(s\) must be divisible by 2.
2) \(s/2\) must be divisible by \(m\).
3) \(m < \sqrt{s/2}\) because \(m < k = m+n\).
4) \(s/(2m)\) must be divisible by \(k = m+n\).
5) \(m\) and \(k = m+n\) are coprime (\(gcd(m,k)=1\)) since \(m\) and \(n\)
are coprime.
6) \(k = m+n\) is odd.

From these observations we can write an algorithm that, in the outer loop,
checks all valid \(m\), and, in the inner loop, checks all valid \(k\) for the
chosen \(m\). We know that there is only one triple for \(a+b+c=1000\), but if
we spend the extra time to check all possible entries, we can generalize this
code for problem 39 and 75.

#+begin_src python
def pythagorean_triples_from_sum(s):
    """Find all Pythagorean triples `a^2+b^2=c^2' such that `a+b+c=s' and
    `0<a<b<c<s'.
    """
    trip = []
    for m in range(2,int((s/2)**0.5)+1):
        if (s//2)%m==0:
            if m%2==0:
                k = m+1
            else:
                k = m+2
            while (k < 2*m) and k <= s/(2*m):
                if (s//(2*m))%k==0 and gcd(m,k)==1:
                    d = s//(2*k*m)
                    n = k - m
                    a = d*(m**2-n**2)
                    b = d*2*m*n
                    c = d*(m**2+n**2)
                    trip += [(min(a,b),max(a,b),c)]
                k += 2
    return trip

assert pythagorean_triples_from_sum(12)[0]==(3,4,5)
assert pythagorean_triples_from_sum(40)[0]==(8,15,17)
#+end_src

#+RESULTS:
: [(3, 4, 5)]

The algorithm is extremely efficient for this small sum.

#+begin_src python
a,b,c = pythagorean_triples_from_sum(1000)[0]
print([a,b,c])
print(a*b*c)

time = min(timeit.repeat(
    "pythagorean_triples_from_sum(1000)[0]",
    "from __main__ import pythagorean_triples_from_sum",
    number=1000
))*1000

print("t = %.2f us" % time)
#+end_src

#+RESULTS:
: [200, 375, 425]
: 31875000
: t = 5.52 us

It is also scalable to large sums since it only needs to check the primitive
triples.

#+begin_src python
triples = pythagorean_triples_from_sum(10**9)
for a,b,c in triples:
    print([a,b,c])

time = min(timeit.repeat(
    "pythagorean_triples_from_sum(10**9)",
    "from __main__ import pythagorean_triples_from_sum",
    number=1
))*1000

print("t = %.2f ms" % time)
#+end_src

#+RESULTS:
: [200000000, 375000000, 425000000]
: [218750000, 360000000, 421250000]
: [23437500, 488000000, 488562500]
: t = 11.67 ms

* 10 Summation of primes
** Q:

The sum of the primes below 10 is 2 + 3 + 5 + 7 = 17.

Find the sum of all the primes below two million.

** A:

In [[* 5 Smallest multiple][problem 5]] the Sieve of Eratosthenes let us find primes below an upper bound.
The same is done here, and the results are summed.

#+begin_src python
print(sum(esieve(2000000)))

time = min(timeit.repeat(
    "sum(esieve(2000000))",
    "from __main__ import esieve",
    number=1
))*1000

print("t = %.2f ms" % time)
#+end_src

#+RESULTS:
: 142913828922
: t = 104.59 ms
